/*
*********************************************************************************************************
*                                               uC/OS-II
*                                               实时内核
*
*                        (c) Copyright 1992-1998, Jean J. Labrosse, Plantation, FL
*                                               版权所有
*
*                                            MCU-51 专用代码
*                                           KEIL C51大模式编译
*
* 文件名 : OS_CPU_C.C
* 作者   : Jean J. Labrosse
* 改编   : 杨屹 gdtyy@ri.gdt.com.cn 巨龙公司系统集成开发部 2002.09.27
*********************************************************************************************************
*/

#define  OS_CPU_GLOBALS
#include "includes.h"
/*
*********************************************************************************************************
*                                        初始化任务堆栈
*
* 描述       : 这个函数被OSTaskCreate()或OSTaskCreateExt()调用，以便初始化新创建任务的堆栈结构。本函数
*              与处理器高度相关。
*
* 参数       : task          指向任务代码的指针
*
*              pdata         当任务第一次执行时将要传入任务的用户数据结构指针
*
*              ptos          栈顶指针。ptos指针被默认为用户堆栈入口指针。如果OS_STK_GROWTH被置1，那么，
*                            ptos指向用户堆栈的最高有效地址。同样地，如果OS_STK_GROWTH清0，ptos将指向
*                            用户堆栈的最低有效地址。
*
*              opt           指定可以改变OSTaskStkInit()行为的选项。(见uCOS_II.H for OS_TASK_OPT_???)。
*
* 返回值     : 我修改了原来的程序，使函数总是返回用户堆栈空间的最低有效地址。这样修改提高了TCB换入换出
*              的效率。
*
* 注意       : 任务堆栈结构:
*
*                                    ---------- -
*                 用户栈最高地址---->|        | |
*                                    ---------- |
*                                    |   ...  | 仿真堆栈空间
*----------                          ---------- | 每任务一个
*|OSTCBCur|               ?C_XBP---->|        | | KEIL自动处理
*----------                          ---------- -
*    |                               |空闲间隔|
*    |     -----------------------   ----------                           ----------
*    \---->|OSTCBCur->OSTCBStkPtr|   |?C_XBP低|                    SP---->|        |
*          -----------------------   ----------                           ----------
*                     |              |?C_XBP高|                           |        |
*                     |              ---------- -                         ----------
*                     |              |        | |                         |   .    |
*                     |              ---------- |                         |   .    |
*                     |              |        | |                         |   .    |
*                     |              ---------- |                         ----------
*                     |              |   .    |长度                       |        | +1
*                     |              |   .    | |                         ----------
*                     |              |   .    | |             OSStack---->|        | 0
*                     |              ---------- |                         ----------
*                     |              |        | |          OSStkStart---->| 不关心 | -1  低地址
*                     |              ---------- -                         ----------
*                     \------------->|  长度  | 低地址                   系统硬件堆栈
*                                    ----------
*                                     用户堆栈                       长度=SP-OSStkStart
*********************************************************************************************************
*/

void *OSTaskStkInit (void (*task)(void *pd), void *ppdata, void *ptos, INT16U opt) reentrant
{    
    OS_STK *stk;

    ppdata = ppdata;
    opt    = opt;                               //opt没被用到，保留此语句防止告警产生    
    stk    = (OS_STK *)ptos;                    //用户堆栈最低有效地址
    *stk++ = 15;                                //用户堆栈长度
    *stk++ = (INT16U)task & 0xFF;               //任务地址低8位
    *stk++ = (INT16U)task >> 8;                 //任务地址高8位    
    *stk++ = 0x00;                              //PSW
    *stk++ = 0x0A;                              //ACC
    *stk++ = 0x0B;                              //B
    *stk++ = 0x00;                              //DPL
    *stk++ = 0x00;                              //DPH
    *stk++ = 0x00;                              //R0
    *stk++ = 0x01;                              //R1
    *stk++ = 0x02;                              //R2
    *stk++ = 0x03;                              //R3
    *stk++ = 0x04;                              //R4
    *stk++ = 0x05;                              //R5
    *stk++ = 0x06;                              //R6
    *stk++ = 0x07;                              //R7
                                                //不用保存SP，任务切换时根据用户堆栈长度计算得出。    
    *stk++ = (INT16U) (ptos+MaxStkSize) >> 8;   //?C_XBP 仿真堆栈指针高8位
    *stk++ = (INT16U) (ptos+MaxStkSize) & 0xFF; //?C_XBP 仿真堆栈指针低8位
        
    return ((void *)ptos);
}

#if OS_CPU_HOOKS_EN
/*
*********************************************************************************************************
*                                          任务创建钩挂函数
*
* 描述       : 任务创建时调用
*
* 参数       : ptcb是指向将被创建任务的任务控制块的指针。
*
* 注意       : 1) 调用期间中断被禁止
*********************************************************************************************************
*/
void OSTaskCreateHook (OS_TCB *ptcb) reentrant
{
    ptcb = ptcb;                       /* Prevent compiler warning                                     */
}


/*
*********************************************************************************************************
*                                          任务删除钩挂函数
*
* 描述       : 任务删除时调用
*
* 参数       : ptcb是指向将被删除任务的任务控制块的指针。
*
* 注意       : 1) 调用期间中断被禁止
*********************************************************************************************************
*/
void OSTaskDelHook (OS_TCB *ptcb) reentrant
{
    ptcb = ptcb;                       /* Prevent compiler warning                                     */
}

/*
*********************************************************************************************************
*                                          任务切换钩挂函数
*
* 描述       : 执行任务切换时调用。这允许你在上下文切换期间执行其它操作。
*
* 参数       : 无
*
* 注意       : 1) 调用期间中断被禁止
*              2) 假定全局指针'OSTCBHighRdy'已经指向了将要被换入的任务控制块(即:最高优先级任务)，并且
*                 'OSTCBCur'指向了将被换出的任务(即:当前任务)。
*********************************************************************************************************
*/
void OSTaskSwHook (void) reentrant
{
}

/*
*********************************************************************************************************
*                                          统计任务钩挂函数
*
* 描述       : 这个函数每秒钟被uC/OS-II统计任务调用。这么做使你的应用程序可以增加统计任务的功能。
*
* 注意       : 无
*********************************************************************************************************
*/
#if			OS_TASK_STAT_EN
void OSTaskStatHook (void) reentrant
{

}
#endif

/*
*********************************************************************************************************
*                                          定时钩挂函数
*
* 描述       : 本函数每一滴答被调用一次。
*
* 参数       : 无
*
* 注意       : 1) 在本调用期间中断可以或不可以使能。
*********************************************************************************************************
*/
void OSTimeTickHook (void) reentrant
{
}
#endif

//初始化定时器1
/*void InitTimer1(void) reentrant
{
    TMOD=TMOD&0x0F0;
    TMOD=TMOD|0x10;		//模式1(16位定时器)，仅受TR0控制
    TH1=0xB8;			//定义Tick=20次/秒(即0.05秒/次)
    TL1=0x36;			//OS_CPU_A.ASM  和  OS_TICKS_PER_SEC
	ET1=1;				//允许T1中断
    TR1=1;   
}*/

/*void InitTimer2(void) reentrant//Tick=20
{
    T2CON  = 0X00;
	T2MOD  = 0X00;
	RCAP2H = 0X4B;					
	RCAP2L = 0XFD;					
	TR2    = 1;
	ET2    = 1;
}*/

void InitTimer2(void) reentrant//Tick=20
{
    T2CON  = 0X00;
	T2MOD  = 0X00;
	RCAP2H = 0XDB;				
	RCAP2L = 0XFF;				
	TR2    = 1;
	ET2    = 1;
}